# shuffle(CODE, random=lambda:0.14455)
CODE = ['é', 'I', 'S', 'q', 'd', '²', '8', '"', 'h', 'w', 'A', '~', '?', 'T', 'R', 'D', 'm', '\n', 'n', 'o', '-', '|', '&', 'p', ' ', 'C', '{', 'a', 'b', 'c', 'i', 'e', 'E', 'H', 'F', '_', 'U', 'ç', 'ê', 'ô', 'â', 'J', 'K', '§', 'L', '^', 'M', "'", 'N', 'j', 'O', 'Y', 'Z', 'f', 'g', '[', 'r', 's', 't', 'u', 'v', '©', 'x', '0', 'y', 'z', '1', '2', '}', '4', 'W', '5', 'G', '6', 'k', '7', ',', '@', '!', '.', '(', ';', ':', '/', "'", '*', '+', 'P', '3', 'V', 'B', '#', 'Q', 'l', 'X', ')', 'î', '9', ']']

def mpkey(chaine):
    Val = []
    chaine = list(chaine)
    for i in chaine:
        if i in CODE:
            Val.append(str(CODE.index(i)))
    Val = ''.join(Val)
    Val = int(Val)
    return Val / 1000000000000

def mpkey1(chaine):
    CODE1 = ['é', 'I', 'S', 'q', 'd', '²', '\t', '8', '"', 'h', 'w', 'A', '~', '?', 'T', 'R', 'D', 'm', '\n', 'n', 'o', '-', '|', '&', 'p', ' ', 'C', '{', 'a', 'b', 'c', 'i', 'e', 'E', 'H', 'F', '_', 'U', 'ç', 'ê', 'ô', 'â', 'J', 'K', '§', 'L', '^', 'M', "'", 'N', 'j', 'O', 'Y', 'Z', 'f', 'g', '[', 'r', 's', 't', 'u', 'v', '©', 'x', '0', 'y', 'z', '1', '2', '}', '4', 'W', '5', 'G', '6', 'k', '7', ',', '@', '!', '.', '(', ';', ':', '/', "'", '*', '+', 'P', '3', 'V', 'B', '#', 'Q', 'l', 'X', ')', 'î', '9', ']']
    Val = []
    chaine = list(chaine)
    for i in chaine:
        if i in CODE1:
            Val.append(str(CODE1.index(i)))
    Val = ''.join(Val)
    Val = int(Val)
    return Val / 10000000000000000000000000000000


